[{"category": "business", "title": "All Adani stocks end higher for the first time since Hindenburg report", "content": "All 10 Adani Group stocks closed higher on Wednesday, the first such occurrence since the report by US short-seller Hindenburg Research in late January that accused the group of fraud. Adani Enterprises led the rally, advancing almost 15% as the group conducted investor meetings in Singapore and Hong Kong. Adani Transmission and Adani Power rose by the 5% daily limit."}, {"category": "business", "title": "Smriti Irani's 2011 tweet on LPG price hike resurfaces after rise in LPG cylinder prices", "content": "Hours after the central government raised the price of commercial LPG cylinders by ₹350.50 per unit and domestic LPG cylinders by ₹50 per unit, Union Minister Smriti Irani's old tweet from 2011 resurfaced on social media. Her tweet read, \"50 rupee hike in LPG!!!!! [And] they call themselves Aam Aadmi ki Sarkar. What a shame!\"\n\n"}, {"category": "business", "title": "Indian-Americans Renjen, Subramaniam to be members of US Export Council", "content": "Indian-Americans Punit Renjen and Rajesh Subramaniam will be members of US President Joe Biden's Export Council. While Renjen serves as Deloitte Global's CEO Emeritus, Subramaniam is President & CEO and a board member at FedEx Corporation. In 2023, he received the Pravasi Bharatiya Samman Award the highest civilian award presented by the President of India to the Indian diaspora."}, {"category": "business", "title": "Adani secures $3 bn credit from a sovereign wealth fund: Report", "content": "Adani Group has reportedly told creditors it has secured a $3 billion loan from a sovereign wealth fund. The credit line from the sovereign wealth fund could be increased to $5 billion. The reports cited a memo that was circulated to participants as highlights of a three-day investor roadshow that ended on Wednesday."}, {"category": "business", "title": "We can score a century for progress: Gates on meeting Tendulkar", "content": "Microsoft Co-founder Bill Gates shared a message on Twitter after meeting former cricketer Sachin Tendulkar and his wife Anjali Tendulkar in Mumbai on Tuesday. \"I had a great time learning more about your work in children's healthcare,\" Gates said. \"I'm optimistic that, working together, we can score a century for progress!\" he added."}, {"category": "business", "title": "Mandaviya shows Bill Gates COVID-19 war room which used AI", "content": "Health Minister Mansukh Mandaviya showed Microsoft Co-founder Bill Gates India's COVID-19 war room, the National Public Health Observatory. The room, shaped during the pandemic, used AI to track cases, vaccination efficiency, progress of health programmes and health initiatives. Bill Gates appreciated India's COVID-19 vaccination and health initiatives like Ayushman Bharat, Mandaviya tweeted."}, {"category": "business", "title": "India to be world's cheapest 5G market: Bill Gates", "content": "At a session with Telecom Minister Ashwini Vaishnaw, Microsoft Co-founder Bill Gates praised India's digital infrastructure and said that India has been a leader in providing access to digital banking. Stating that India has \"very good\" connectivity, Gates added that India will be the cheapest 5G market. Gates added that no country built a more comprehensive digital infrastructure than India."}, {"category": "business", "title": "Foxconn Chairman meets PM Modi for 2nd time in 8 months", "content": "Apple supplier Foxconn's Chairman Young Liu on Tuesday met Prime Minister Narendra Modi for the second time in eight months. In June 2022, PM met Young and welcomed Foxconn's plans for expanding its electronics manufacturing capacity in India. The company tweeted, \"Foxconn will continue to build an ecosystem in India allowing all our stakeholders to share, collaborate and thrive.\""}, {"category": "business", "title": "No nation built more comprehensive digital infra than India: Gates", "content": "Microsoft Co-founder Bill Gates said that no country has built a more comprehensive digital infrastructure than India. Gates noted that prior to digital infrastructure, achieving the number of bank accounts that India has today would have taken 50 years. He added the infrastructure allows the Gates Foundation to make payments to workers in the field."}, {"category": "business", "title": "Days of authoritarian leadership diminishing: Rishad Premji", "content": "Wipro Chairman Rishad Premji said that the days of the authoritarian leader \"are more and more diminishing\". \"The space for authentic, empathetic, vulnerable leadership where I can say 'I need help, I don't know', is very much becoming pervasive,\" Premji said. Premji also said that it is important to encourage an environment of risk-taking and celebrate failures."}, {"category": "business", "title": "Blinkit to launch Urban Company-like home services: Report", "content": "Zomato-owned Blinkit is planning to launch a new vertical to offer Urban Company-like services, Entrackr reported citing sources. \"Blinkit is set to offer handyman services such as plumbing, electrician, beautician and air conditioner repairing etc on its platform in coming weeks,\" said a source. Zomato CEO Deepinder Goyal has resigned as an independent director in Urban Company's board."}, {"category": "business", "title": "SaaS startup Yellow.ai lays off around 250 employees since August", "content": "SaaS startup Yellow.ai﻿ has laid off around 250 employees since August 2022, with majority of workers from India, YourStory reported citing sources. It has reduced the jobs over four rounds in August, November, December and January-February, the sources said. The sources alleged that Yellow.ai forced the employees to sign non-disclosure agreements, preventing them from speaking about the job cuts."}, {"category": "business", "title": "Swiggy, Zomato delivery agents wrongly issued challans in Delhi", "content": "Swiggy and Zomato said their delivery agents are wrongly being issued challans in Delhi, meant for bike taxi services, after a regulation change. A Swiggy spokesperson said challans worth over ₹15,000 were issued which created panic among delivery agents. Recently, Delhi government's Transport Department cautioned bike taxis against plying in the national capital and said this could attract fines."}, {"category": "business", "title": "Pak due to repay foreign debt, interest of $22 bn in 1 yr: Report", "content": "Pakistan is due to repay foreign debt and interest worth almost $22 billion over next 12 months, The Express Tribune reported. As of December 2022, Pakistan's external debt stood at PKR 17.87 trillion, down from PKR 18 trillion in September, according to State Bank of Pakistan's data. Meanwhile, Pakistan's net foreign exchange reserves were around $3.2 billion on February 17."}, {"category": "business", "title": "Eli Lilly to cut insulin price by 70% for Americans from Q4 ", "content": "Eli Lilly on Wednesday said it will reduce prices for its most commonly prescribed forms of insulin, Humalog and Humulin, by 70% effective from the fourth quarter. Lilly will reduce the price of its non-branded, fast-acting insulin to $25 a vial from May 1. \"Aggressive price cuts...should make a real difference for Americans with diabetes,\" Lilly's CEO David Ricks said. \n\n\n\n\n"}, {"category": "business", "title": "Mumbai jumps to 37th rank in global luxury home price rise: Report", "content": "Mumbai's rank climbed to 37th from 92nd in a global list of movement in luxury home prices as it saw an appreciation of 6.4% during 2022, according to Knight Frank India. Mumbai is the 18th most expensive prime residential market in the world, the report said. Prime properties in Mumbai are expected to witness an appreciation of 3% in 2023.\n"}, {"category": "business", "title": "Offered 3,600 Citibank staff to join us, 400 denied: Axis Bank CEO", "content": "Axis Bank CEO Amitabh Chaudhry said the bank offered all 3,600 employees of Citibank to join Axis Bank post the acquisition but 400 employees didn't accept the offer. \"We've kept the same representatives from Citibank on board to Axis Bank to keep the comfort level with the customers,\" said Axis Bank Group Executive Subrat Mohanty. "}, {"category": "business", "title": "World's richest people lost total of $10 trillion in 2022: Report", "content": "The combined wealth of the 2.18 lakh people classed as 'ultra-high net worth individuals' (UHNWIs) fell by 10% from $101.5 trillion in 2021 to $91.4 trillion in 2022, according to Knight Frank's wealth report. The biggest fall in net worth was seen among Europeans with an average decline of 17%, while in the Americas the fall was at 10%."}, {"category": "business", "title": "Venus Williams joins private equity firm Topspin", "content": "Seven-time Grand Slam champion Venus Williams is joining private equity firm Topspin Consumer Partners as its newest Operating Partner to invest in health and wellness businesses. Williams is a \"terrific addition to the team\", Topspin Managing Partner Leigh Randall said. \"We wanted someone who could really help us on the health and wellness front,\" Randall added."}, {"category": "business", "title": "India Inc to roll out 9-9.5% salary hike in 2023: Report", "content": "India Inc will roll out pre-pandemic levels of salary hikes with a projected increase of 9-9.5% across industries in 2023, Mercer's Total Remuneration Survey said. Hi-tech and shared services and outsourcing industries will register highest salary hikes of 9.5% and 9.1%, respectively. Consumer and retail, auto, agriculture and chemicals are likely to give an average hike of 9%, it noted.\n"}, {"category": "business", "title": "India's growth cycle has peaked, is headed downward: Nomura ", "content": "Nomura anticipates a slowdown in growth in FY24 with chances of further downside in the following year. \"India's Q4 2022 GDP growth was disappointing, moderating to 4.4% on-year from 6.3% in Q3. This is partly due to base effects and past revisions,\" it said, adding, \"We believe India's growth cycle has peaked and is headed significantly lower than consensus expectations.\" \n"}, {"category": "business", "title": "Plea to reinstate pilot part of Air India peeing incident rejected", "content": "Directorate General of Civil Aviation on Wednesday rejected an appeal to revoke the suspension of an Air India pilot who was flying the plane when a man urinated on his co-passenger in November. The pilot was suspended for failing to perform his duties as per rules in connection to the incident. The pilot's license was also suspended for three months."}, {"category": "business", "title": "Nilekani's trust sells Bengaluru property for ₹54.70 crore: Report", "content": "NRJN Family Trust set up by Infosys Co-founder and Chairman Nandan Nilekani has sold a property in Bengaluru’s Billionaire Street in Koramangala area for ₹54.70 crore, documents accessed by Zapkey.com showed. The buyer of the 9,488 sqft plot is the wife of C Valliappa, the Founder of Sona Valliappa Group. The trust bought the property for ₹39.85 crore in 2019."}, {"category": "business", "title": "Hinduja Global Solutions buys 100% stake in TekLink for $58.8 mn", "content": "Hinduja Global Solutions (HGS) announced that it has completed the acquisition of a 100% stake in TekLink International for $58.8 million. The US-based TekLink has delivery centres in Hyderabad and Indore in India. \"The acquisition will strengthen HGS' digital solutions business by adding enhanced expertise in building data platforms, analytics and financial planning,\" the company said."}, {"category": "business", "title": "GST collection in Feb at ₹1.49 lakh crore, up 12% YoY", "content": "The government collected over ₹1.49 lakh crore as goods and services tax (GST) in February 2023, 12% higher than GST collected in February 2022, Ministry of Finance said. GST collections have exceeded the ₹1.4-lakh crore mark for 12 months in a row. February saw the highest cess collection of ₹11,931 crore since implementation of GST."}, {"category": "sports", "title": "India's Ravichandran Ashwin becomes world number one Test bowler", "content": "Team India all-rounder Ravichandran Ashwin has become the world number one Test bowler, replacing England fast bowler James Anderson. The 36-year-old claimed the top spot after taking six wickets in India's victory over Australia in the second Test in Delhi. Ashwin is also the world number two Test all-rounder currently."}, {"category": "sports", "title": "Family of Kobe Bryant awarded around ₹240 crore over crash scene photos", "content": "Los Angeles County will pay Kobe Bryant's family nearly $29 million (around ₹240 crore) to settle lawsuit over allegations that officials shared photos of crash that killed Kobe in a bar. Kobe's wife Vanessa had sued the County, alleging invasion of privacy. \"Today marks...successful culmination of Vanessa's...battle to hold accountable those who engaged in...grotesque conduct,\" her lawyer said."}, {"category": "sports", "title": "National record holder triple jumper Aishwarya Babu banned for 4 years for doping", "content": "India's national record holder triple jumper Aishwarya Babu has been banned by NADA for four years for using a prohibited anabolic steroid. She has until March 6 to file an appeal against the ban after receiving the ban notice from NADA's Appeal Panel on February 13. She was provisionally suspended in July last year."}, {"category": "sports", "title": "France's Just Fontaine, who scored most goals in a single FIFA WC edition, dies at 89", "content": "French forward Just Fontaine, who scored most goals in a single FIFA World Cup edition (13 in 1958 edition), passed away aged 89. Fontaine is joint-fourth on the list of leading goalscorers in FIFA World Cup alongside Lionel Messi with 13 goals. Fontaine scored 30 goals from 21 international matches for France between 1953 and 1960."}, {"category": "sports", "title": "I just didn't agree with a lot of his opinions: Mark Waugh on commentating with Karthik", "content": "Ex-Australia batter Mark Waugh, who commentated in first two India-Australia Test matches, stated he \"just didn't\" agree with a lot of Dinesh Karthik's opinions. \"He couldn't work out my field settings etc,\" Waugh added. He further stated, \"I think Mitchell Johnson's taken over my role in next two Tests with Matthew Hayden...just to give some balance to...commentary box in India.\""}, {"category": "sports", "title": "14 wickets fall on Day 1 of Indore Test as Australia lead India by 47 runs", "content": "As many as 14 wickets fell on first day of the Indore Test as Australia ended the day at 156/4 in their first innings, leading India by 47 runs. Ravindra Jadeja took all four wickets for India. India were bowled out for 109 runs in 33.2 overs in their first innings, with Australia spinner Matthew Kuhnemann taking a five-wicket haul."}, {"category": "sports", "title": "Virat Kohli's reaction to Umesh Yadav equalling his tally of sixes in Tests goes viral", "content": "A video has gone viral on social media showing Virat Kohli's reaction to Umesh Yadav equalling his tally of sixes in Test cricket during the first innings of the Indore Test against Australia. Kohli was seen laughing and clapping for Yadav. Kohli and Yadav have hit 24 sixes each in their Test careers."}, {"category": "sports", "title": "Mumbai Indians officially name Harmanpreet Kaur as their captain for WPL", "content": "Mumbai Indians on Wednesday officially named Harmanpreet Kaur as their captain for the first-ever Women's Premier League. Harmanpreet had recently become the first-ever cricketer to play 150 T20Is. Mumbai Indians will play the season opener of WPL 2023 on March 4, 2023, at DY Patil Stadium against Gujarat Giants."}, {"category": "sports", "title": "Umesh Yadav equals Kohli's tally of sixes in Test cricket; overtakes Yuvraj, Shastri", "content": "Team India fast bowler Umesh Yadav on Wednesday equalled Virat Kohli's tally of sixes in Test cricket. The 35-year-old smashed two sixes in India's first innings in the Indore Test against Australia to take his tally of sixes in Test cricket to 24. Umesh overtook Yuvraj Singh and Ravi Shastri, who hit 22 sixes each in their Test careers."}, {"category": "sports", "title": "You are a harsh man: Hayden to Gavaskar over remark on Shubman's injury", "content": "Former Australia opener Matthew Hayden called Sunil Gavaskar a \"harsh man\" after the latter's remark on Shubman Gill's injury in the third Test against Australia in Indore. Talking about Gill taking treatment in between an over, Gavaskar had said, \"This could have waited. This could have waited till the end of the over.\""}, {"category": "sports", "title": "Australia's Peter Handscomb caught sleeping during Indore Test, pic surfaces", "content": "Australia batter Peter Handscomb was spotted seemingly sleeping in the dressing room during his team's first innings in the Indore Test against India. Reacting to a picture that surfaced online, an Indian fan wrote, \"Allan Border has definitely booked himself a flight to India in response to footage of Handscomb taking a nap during a Test.\""}, {"category": "sports", "title": "Kohli doesn't give rest in nets, don't get time to settle: Siraj", "content": "Discussing Team India's net sessions, Team India pacer Mohammed Siraj said, \"Virat Kohli...does not give rest to...[pacers].\" \"After hitting the shot...[a batter] looks here and there, but Kohli gets ready immediately...I don't even get time to settle,\" added Siraj. Former India bowling coach Bharat Arun earlier stated that Siraj told him he'll do whatever it takes to emulate Kohli."}, {"category": "sports", "title": "You've married most stubborn man I've met: Nayar to Shardul's wife", "content": "Reacting to cricketer Shardul Thakur marrying his longtime girlfriend Mittali Parulkar, KKR assistant coach Abhishek Nayar said Mittali has married the most stubborn man he's met. \"I'm hoping to wait for that day when Shardul bows his head down and says, 'Mittali, you are right and whatever you say is right',\" added Nayar. \"Shardul always believes he's right,\" he stated."}, {"category": "sports", "title": "I was fighting the tears: SA batter Markram after Test ton vs WI", "content": "South African opener Aiden Markram, who scored a century in a Test match against West Indies on Tuesday, said he was \"fighting the tears a bit\". \"It meant quite a lot to me, it's been a strange journey, so I'm just grateful that it worked out,\" he added. This was Markram's sixth Test century."}, {"category": "sports", "title": "Babar isn't threat for bowlers even if he's set: Pak's Imam Ul Haq", "content": "Reacting to former Pakistan captain Shahid Afridi's statement that Babar Azam hasn't proved himself as a match-winner yet, Pakistan opener Imam Ul Haq said, \"Babar...[is] not a threat for bowlers even if he is set.\" \"After he reaches 50, Babar really needs to express himself,\" added Imam. \"Babar has to work on his strike rate as well,\" he stated."}, {"category": "sports", "title": "Babar has not yet proved himself as a match-winner: Shahid Afridi", "content": "Former Pakistan captain Shahid Afridi said Babar Azam hasn't proved himself as a match-winner yet. \"No doubt, Babar is the number one player in the world...However, one thing that stops him from being named along with...AB de Villiers and Virat Kohli is finishing games,\" Afridi added. Azam had won the ICC Men's Cricketer of the Year Award 2022."}, {"category": "sports", "title": "Break after 2nd Test vs India was forced, had no facilities: Starc", "content": "Australia pacer Mitchell Starc termed the break after the second Test against India, which took place in Delhi, as \"forced\". \"With no facilities for training, it was a forced break for a lot of people [who] might have wanted to get out there,\" added Starc. \"There [are] personal adaptations [that one has to make] in these conditions,\" he stated."}, {"category": "sports", "title": "Good template for Test cricket: Ex-Aus spinner Beer on Indore Test", "content": "Former Australia spinner Michael Beer took to Twitter to state that Day 1 of the ongoing third Test between India and Australia, which is being held in Indore, witnessed \"very entertaining\" cricket. \"This pitch would be a good template for all red ball cricket!\" added Beer. \"I have a problem with these conditions,\" ex-Australia opener Matthew Hayden had earlier stated."}, {"category": "sports", "title": "Bowling coach should sit with him: Gavaskar on Jadeja's no-ball", "content": "Sunil Gavaskar said India bowling coach Paras Mhambrey should sit with Ravindra Jadeja and make him bowl from behind, following Jadeja's no-ball in Australia's first innings of third Test, which resulted in Marnus Labuschagne's dismissal being overturned. Gavaskar added that a spinner bowling a no-ball is not acceptable. \"This could [go on to] cost India,\" he stated."}, {"category": "sports", "title": "Ex-world no. 1 Angelique Kerber welcomes baby girl; shares pic", "content": "Former world number one Angelique Kerber revealed that she has welcomed her first child, a baby daughter, with partner Franco Bianco. Kerber shared a black and white photo of the baby's hand resting on her parents' fingers on social media. \"Having you with us is the most beautiful & overwhelming feeling we could have ever imagined,\" Kerber captioned the photo."}, {"category": "sports", "title": "Graeme Smith dominated the room while speaking as captain: Plessis", "content": "Hailing Graeme Smith when he was South Africa captain, Proteas cricketer Faf du Plessis said he \"dominated the room while speaking\". \"I was like, 'Wow, this guy's got an amazing presence when he speaks, like this big, blinding roar at you',\" he added. Du Plessis, who'll lead RCB in IPL 2023, said he always wanted to learn from \"great leaders\"."}, {"category": "sports", "title": "It's more special after tough year: Djokovic on being world no. 1", "content": "Tennis player Novak Djokovic said his return to the top of the world rankings felt like a big achievement after a tough 2022, where he had to skip two Grand Slams. \"I'm overwhelmed with pride,\" Djokovic added. The Serbian is now into his 378th week as world number one, surpassing Steffi Graf's record for the most weeks at the top."}, {"category": "sports", "title": "We can score a century for progress: Gates on meeting Tendulkar", "content": "Microsoft Co-founder Bill Gates shared a message on Twitter after meeting former cricketer Sachin Tendulkar and his wife Anjali Tendulkar in Mumbai on Tuesday. \"I had a great time learning more about your work in children's healthcare,\" Gates said. \"I'm optimistic that, working together, we can score a century for progress!\" he added."}, {"category": "sports", "title": "Have problem with conditions, sorry for fans: Hayden on 3rd Test", "content": "Talking about the ongoing third Test between India and Australia, ex-Australia opener Matthew Hayden said, \"The average turn is 4.8 degrees. That's...massive...This is why I have a problem with these conditions.\" \"It doesn't matter whether Australia win this Test or India...At this pace, I feel sorry for...fans, I don't think this Test will [last till] Day 4,\" added Hayden."}, {"category": "sports", "title": "Unacceptable: Harsha Bhogle on Ravindra Jadeja bowling no-ball", "content": "Reacting to Australia batter Marnus Labuschagne's dismissal being overturned following a no-ball by Ravindra Jadeja in Australia's first innings of third Test, commentator Harsha Bhogle tweeted, \"No-ball for anyone, especially a spinner, has to be unacceptable.\" \"Jadeja's...exceptional...but this is an infection that's taking time to go,\" added Harsha. Labuschagne would've been out for a duck."}, {"category": "technology", "title": "Twitter down for thousands of users worldwide", "content": "Microblogging platform Twitter suffered an outage on Wednesday, leaving thousands of users unable to refresh their feeds. Reports of the outage began to emerge with users from various countries, including the United States, the United Kingdom, Japan, and India. This comes after reports said that Elon Musk-led Twitter recently laid off up to 200 employees."}, {"category": "technology", "title": "Thought it was spam, ignored it: Indian-American fired by Google over e-mail", "content": "Vishal Arora, the former Head of Engineering of Platform Services at Google Ads, was one of the 12,000 employees laid off by Google. The Indian-American received an e-mail with the subject: \"Notice regarding your employment\" on his personal Gmail. Arora assumed it to be spam and ignored it only to open it minutes later and find that he was fired."}, {"category": "technology", "title": "Twitter employee seen sleeping on office floor shares meme after getting fired", "content": "Esther Crawford, whose picture of sleeping on the floor at Twitter's San Francisco headquarters after Elon Musk's takeover of the company went viral, was recently fired from Twitter. She took to the platform to share a meme on herself about sleeping in a sleeping bag. \"If you can't take being publicly dunked on then avoid taking any risks,\" she tweeted."}, {"category": "technology", "title": "We can score a century for progress: Gates on meeting Tendulkar", "content": "Microsoft Co-founder Bill Gates shared a message on Twitter after meeting former cricketer Sachin Tendulkar and his wife Anjali Tendulkar in Mumbai on Tuesday. \"I had a great time learning more about your work in children's healthcare,\" Gates said. \"I'm optimistic that, working together, we can score a century for progress!\" he added."}, {"category": "technology", "title": "Foxconn Chairman meets PM Modi for 2nd time in 8 months", "content": "Apple supplier Foxconn's Chairman Young Liu on Tuesday met Prime Minister Narendra Modi for the second time in eight months. In June 2022, PM met Young and welcomed Foxconn's plans for expanding its electronics manufacturing capacity in India. The company tweeted, \"Foxconn will continue to build an ecosystem in India allowing all our stakeholders to share, collaborate and thrive.\""}, {"category": "technology", "title": "Mandaviya shows Bill Gates COVID-19 war room which used AI", "content": "Health Minister Mansukh Mandaviya showed Microsoft Co-founder Bill Gates India's COVID-19 war room, the National Public Health Observatory. The room, shaped during the pandemic, used AI to track cases, vaccination efficiency, progress of health programmes and health initiatives. Bill Gates appreciated India's COVID-19 vaccination and health initiatives like Ayushman Bharat, Mandaviya tweeted."}, {"category": "technology", "title": "Bing sentient but more unstable as a persona: Ex-Google techie", "content": "Ex-Google engineer, Blake Lemoine, who claimed the company's artificial intelligence (AI) LaMDA had become sentient has now said the same about Microsoft's Bing. Lemoine said he hasn't been able to test Microsoft's Bing yet but added, \"Based on the various things that I've seen online, it looks like it might be sentient. However, it seems more unstable as a persona.\"\n"}, {"category": "technology", "title": "90% of ideas coming out of India are copycat: Hotmail Co-founder", "content": "Hotmail Co-founder Sabeer Bhatia said 90% business ideas coming out of India are \"copycat ideas\". India is unprepared for next wave of creative economy and needs to upgrade its education system to create the next set of jobs, he said. \"Even if we're successful in attracting world's manufacturing in India, we'll only have around one lakh new jobs,\" he added."}, {"category": "technology", "title": "Days of authoritarian leadership diminishing: Rishad Premji", "content": "Wipro Chairman Rishad Premji said that the days of the authoritarian leader \"are more and more diminishing\". \"The space for authentic, empathetic, vulnerable leadership where I can say 'I need help, I don't know', is very much becoming pervasive,\" Premji said. Premji also said that it is important to encourage an environment of risk-taking and celebrate failures."}, {"category": "technology", "title": "Telecos cross 3-year 5G rollout target in 6 months: Govt official", "content": "Department of Telecom Additional Secretary VL Kantha Rao said Indian telecom service providers surpassed 5G rollout targets projected for three years in the first six months. He added that rapid rollout of 5G in India showed telecom providers the opportunity of 5G in India. Telecom Minister Ashwini Vaishnaw said that BSNL will start 5G services by April 2024. "}, {"category": "technology", "title": "Google Pixel Watch to call for help if a user takes a hard fall", "content": "Google has rolled out fall detection feature for its Pixel Watch. The feature will use in-built motion sensors to detect if a user has taken a hard fall and will call emergency services if the user doesn't respond within a certain timeframe. The watch can differentiate between taking a hard fall and performing a vigorous physical activity, the company said. "}, {"category": "technology", "title": "Woman loses ₹8 lakh after being locked out of Apple account in US", "content": "A woman in the US has said she was locked out of her Apple account by a thief who stole her iPhone last year and ultimately lost ₹8 lakh. Reyhan Ayas said even the Apple support team \"was not helpful at all\". Ayas said she has now been told there is no way to regain access to her iCloud account."}, {"category": "technology", "title": "Meta trying to extinguish Cambridge Analytica claims: US attorneys", "content": "New Mexico state attorneys have accused Meta of wrongfully claiming that its last year settlement of a case over Cambridge Analytica scandal protects it from a similar lawsuit that the state has filed. The settlement, worth $725 million, was reached at a San Francisco court. It extinguishes claims filed by New Mexico, Meta said on Tuesday."}, {"category": "technology", "title": "No nation built more comprehensive digital infra than India: Gates", "content": "Microsoft Co-founder Bill Gates said that no country has built a more comprehensive digital infrastructure than India. Gates noted that prior to digital infrastructure, achieving the number of bank accounts that India has today would have taken 50 years. He added the infrastructure allows the Gates Foundation to make payments to workers in the field."}, {"category": "technology", "title": "CCI's ruling contradicting itself, plagiarised: Google to NCLAT", "content": "The Competition Commission of India's (CCI) android antitrust ruling contradicted itself and was plagiarised from a 2018 order issued by the European Commission, Google told NCLAT. Promoting its own apps was just a marketing tactic and not a method of foreclosing the market for competitors, it added. Google further argued that CCI is yet to identify any harm to users."}, {"category": "technology", "title": "India to achieve 100% 5G coverage by December 2024: Vaishnaw", "content": "There will be 100% coverage of 5G in India by December 2024, Communications Minister Ashwini Vaishnaw said. \"We had promised India will achieve 5G coverage across 200 cities and districts by March 31 in phase one. As of today, India has covered 387 districts with 5G and 1,00,000 sites,\" Vaishnaw said, adding India's 5G roll-out is among the world's fastest.\n"}, {"category": "technology", "title": "Mobile download speeds in India up by 115% since 5G launch: Report", "content": "The median download speeds across India increased by 115% since the launch of 5G in October last year, network intelligence platform Ookla reported. The speed increased from 13.87 Mbps in September 2022 to 29.85 Mbps in January 2023, the report noted. This resulted in India jumping from 118th position on the Speedtest Global Index in September to 69th in January."}, {"category": "technology", "title": "Andhra Pradesh launches probe into fire at Apple supplier's plant", "content": "The Andhra Pradesh government has launched a probe into the fire at Apple supplier Foxlink's facility. The factories department, which is responsible for ensuring the safety and welfare of workers in the state, is looking to probe how the fire happened, Deputy Chief Inspector of Factories Ramakrishna Reddy said. Foxlink is also investigating the cause of the fire."}, {"category": "technology", "title": "India to be world's cheapest 5G market: Bill Gates", "content": "At a session with Telecom Minister Ashwini Vaishnaw, Microsoft Co-founder Bill Gates praised India's digital infrastructure and said that India has been a leader in providing access to digital banking. Stating that India has \"very good\" connectivity, Gates added that India will be the cheapest 5G market. Gates added that no country built a more comprehensive digital infrastructure than India."}, {"category": "technology", "title": "AI could replace journalists: Germany's largest publisher", "content": "Germany's largest publisher Axel Springer's CEO Mathias Döpfner told employees in an internal letter that AI could replace journalists. \"Artificial intelligence has the potential to make independent journalism better than it ever was, or simply replace it,\" Döpfner said. He also stated that Axel Springer aims to become \"digital only\" and would cut an undisclosed number of jobs."}, {"category": "technology", "title": "Clients ask regularly of plans to expand in India: AirPods maker", "content": "AirPods maker Goertek's Deputy Chairman Kazuyoshi Yoshinaga said the firm gets client requests \"almost every month\", asking of plans to expand to India. People from client side have been pushing for tech manufacturers to move out of China, he added. \"If [clients] decide to build up production lines in India, we may have to think about it seriously,\" Yoshinaga said."}, {"category": "technology", "title": "Indian tech sector set to grow 8.4% in FY23 to $245 bn: NASSCOM", "content": "The Indian technology industry is set to grow by 8.4% in FY23 to become a $245-billion sector, NASSCOM said. The sector added 2.90 lakh new jobs to take the overall number to 54 lakh employees, NASSCOM President Debjani Ghosh said. The industry is on its way to become a $500-billion sector by 2030, she added."}, {"category": "technology", "title": "Elon Musk plays fart sounds in 2 am Twitter Space livestream", "content": "Twitter chief Elon Musk co-hosted a Twitter Space livestream with podcaster Jason Calacanis on Tuesday at 2 am. During the 10-minute-long livestream, Musk tested a \"new mic\" and used a sound board to play a range of sounds including fart noises and flushing of a toilet. He later logged off the livestream, saying, \"I've gotta go to bed.\" "}, {"category": "technology", "title": "Google updates Chrome to increase battery life on MacBooks", "content": "Google has announced several changes to its Chrome web browser that can boost the battery life on MacBooks. By optimising systems like memory compression and JavaScript timers, MacBook users can now browse the web via Chrome and watch YouTube videos for longer, The Verge reported. Notably, Google started testing memory and energy saver modes last year."}, {"category": "technology", "title": "Secret bitcoin mining operation found under school in US", "content": "A man has been charged with stealing thousands of dollars worth of electricity after local authorities discovered an illegal cryptocurrency mining operation underneath a school in the US. Nadeam Nahas has been accused of setting up 11 machines in the crawl space beneath the school. Prosecutors estimate the operation cost the school around $17,500 in electricity during an eight-month period."}, {"category": "entertainment", "title": "Police warned of bombs at Ambani, Amitabh's Mumbai homes in anonymous call: Reports", "content": "Nagpur Police on Tuesday reportedly received an anonymous call that warned of bombs planted at the houses of Mukesh Ambani, Amitabh Bachchan and Dharmendra in Mumbai. As per reports, the information was relayed to Mumbai Police who are searching their residences. The caller also claimed that 25 people were in Mumbai to carry out the attacks."}, {"category": "entertainment", "title": "I like Brad Pitt: Ram Charan as US reporter asks if he liked 'Brad Pitt of India' title", "content": "An American talk show host said 'RRR' actor Ram Charan is being called the 'Brad Pitt of India' and asked the latter, \"Do you like that designation?\" Charan replied, \"I like Brad Pitt for sure.\" A video of Charan's reaction, which came during an interview with a news channel in LA, has been shared widely online."}, {"category": "entertainment", "title": "Actor Naga Shaurya asks man to apologise to girlfriend for slapping her on busy road", "content": "Telugu actor Naga Shaurya was seen getting into an argument with a man and asking him to apologise after the actor saw him slap his girlfriend on a busy road in Hyderabad. \"She could be your lover, it doesn't mean you can misbehave like this,\" the actor said. Onlookers could also be heard telling the man to apologise."}, {"category": "entertainment", "title": "Mika Singh gifts Mercedes to his friend, pic surfaces", "content": "Singer Mika Singh recently gifted a Mercedes car to his friend. The singer's friend Kanwaljeet Singh shared a picture of himself along with Mika and the car and wrote in his caption, \"It's been 30 years that we are together. He is not just my friend or boss, but...we are brothers for life.\" \"You have the biggest heart,\" he added."}, {"category": "entertainment", "title": "Stop calling him Armaan, his name is Sandeep: Armaan on YouTuber with 2 pregnant wives", "content": "Singer Armaan Malik took to Twitter and expressed his displeasure with a YouTuber for calling himself 'Armaan Malik' in public. The YouTuber is known for having two wives, both of whom are pregnant. \"Stop calling him Armaan Malik in...media. His real name is...Sandeep!!...Hate waking up and reading articles like this...and the news makes me even more disgusted,\" he tweeted."}, {"category": "entertainment", "title": "No producer bigger than actor: Shailesh Lodha on quitting 'Taarak Mehta...'", "content": "Actor Shailesh Lodha, who quit the sitcom 'Taarak Mehta Ka Ooltah Chashmah' after a years-long stint, was recently asked at an event about his reason behind leaving the sitcom. \"Maybe I am one of those talented people who has raised his voice,\" said Lodha. \"Any producer cannot be bigger than the actor. He is a businessman,\" he added."}, {"category": "entertainment", "title": "My wife had tumour while she was pregnant with our 2nd child: Ed Sheeran", "content": "Singer Ed Sheeran has revealed that his wife, Cherry Seaborn, was diagnosed with a tumour while she was pregnant with their second child. He shared the news while announcing his forthcoming album, Subtract. \"There was no route to treatment until after the birth,\" he said. The pair announced the birth of their second child in May 2022."}, {"category": "entertainment", "title": "We'd end up matching clothes without planning: Amrita on husband", "content": "Speaking about the similarities that she found with her husband RJ Anmol after they met for the first time, actress Amrita Rao said, \"We clicked together like anything!\" \"We would end up matching clothes without even planning it!\" added Amrita. The couple, who met for the first time during Amrita's movie promotion at a radio station, got married in 2014."}, {"category": "entertainment", "title": "Amitabh Bachchan to play lead role in Ribhu Dasgupta's Section 84", "content": "Actor Amitabh Bachchan will play the lead role in filmmaker Ribhu Dasgupta's courtroom drama thriller 'Section 84'. This will be Amitabh's third collaboration with Dasgupta after working with him in 'Te3n' and 'Yudh'. \"I feel happy, blessed, and honoured to collaborate with sir [Amitabh] again. Looking forward to it,\" Dasgupta said. He is also the writer of the film."}, {"category": "entertainment", "title": "Not solo anymore: Sidharth as paparazzi ask him to pose alone", "content": "Sidharth Malhotra was recently asked to pose solo for pictures. In response to paparazzi's request, Sidharth smiled and said he's \"not solo anymore\". The actor got married to Kiara Advani. Earlier, talking about her, Sidharth said that their marriage was \"meant to be\" and he feels fortunate that they were loved on-screen in 'Shershaah' and are loved off-screen as well."}, {"category": "entertainment", "title": "Nandita said she won't make Zwigato with a star like SRK: Kapil", "content": "Comedian-actor Kapil Sharma said that when Nandita Das narrated the story of 'Zwigato' to him, he asked her, \"Why me?\" In response, Kapil shared that Nandita told him, \"Even if...global star like Shah Rukh Khan says yes, I'll...not make it with him. Your face is like...common man [it's perfect for the character].\" Kapil called himself a fan of Das' work."}, {"category": "entertainment", "title": "His wife Aaliya has tolerated a lot: Shamas on Nawazuddin", "content": "Actor Nawazuddin Siddiqui's brother Shamas Nawab Siddiqui shared that there were problems in the actor and his wife Aaliya's marriage since the beginning. \"As a woman, she has taken a lot. She has tolerated a lot,\" Shamas told ETimes. He also spoke about how Nawazuddin refused to complete his film 'Bole Chudiyan' until the producers paid all his dues."}, {"category": "entertainment", "title": "Broke my heart, we didn't do justice: Shahid on Jersey's failure", "content": "Actor Shahid Kapoor said the failure of his film 'Jersey' broke his heart, adding that they didn't do justice to the movie. \"We could have made better choices...With 'Jersey', I realised that films are like fast food, one has to consume it at that moment,\" he stated. \"Everybody...told me I should not do 'Jersey',\" Shahid had earlier said."}, {"category": "entertainment", "title": "Didn't take leave for my wedding: 'Taarak Mehta…' actor Sacchin", "content": "'Taarak Mehta Ka Ooltah Chashmah' actor Sacchin Shrof said he didn't take any leave for his wedding. \"My producer Asit Kumarr Modi…[was] kind enough to give me a three-day holiday…I will resume work immediately…because we have to deliver the episode,\" he shared. Sacchin got married to Chandani Kothi, who is reportedly an event organiser and interior designer."}, {"category": "entertainment", "title": "I relived my battle: Sagarika on Rani's 'Mrs Chatterjee…' trailer", "content": "Sagarika Chatterjee, whose life inspired Rani Mukerji's 'Mrs. Chatterjee Vs Norway', said she \"broke down\" after watching the film's trailer. \"I felt...I was reliving my battle,\" she said. Chatterjee added, \"I want to thank Rani...for channeling...grief...struggles that I went through to win back my children...I thank her for bringing...mother's painful journey on screen with so much dignity.\""}, {"category": "entertainment", "title": "I was PDA-starved: Kashmera on kissing video with husband Krushna", "content": "Kashmera Shah was seen kissing her husband Krushna Abhishek while the two were posing for the paparazzi present at the location. The actress has now shared that she wasn't drunk but jet-lagged as she had \"just returned\" from Los Angeles. Defending her act of public display of affection (PDA), Kashmera said she hadn't met Krushna for weeks and was \"PDA-starved\"."}, {"category": "entertainment", "title": "I won't pay the bill on a date, says Nora Fatehi", "content": "Kapil Sharma, in a recent episode of 'The Kapil Sharma Show', quoted Nora Fatehi's earlier statement about how she expects men to pay the bill on dates. When Archana Puran Singh said that in today's time, even women pay on dates, Nora stuck to her old opinion and said, \"You can pay but I'm not paying [on dates].\""}, {"category": "entertainment", "title": "Actors today focus on gym and social media more: Govind Namdev", "content": "Actor Govind Namdev has said that the current actors are more focused on the gym and social media. \"When we would get a role, we would be dedicated to it wholly. That would be our focus...Today, that focus is gone,\" he added. Govind stated there used to be connections \"between actors or actors...directors, actors...writers [and] their work\" earlier."}, {"category": "entertainment", "title": "It takes guts: Rajatava on Akshay accepting failure of his films", "content": "Bengali actor Rajatava Dutta praised Akshay Kumar for \"acknowledging...failure of his recent films\". \"You've to have the guts to take...onus of your films not working. What he said is so true. You can't...blame the audience for every film's failure,\" he shared. Referring to Akshay's Aaj Tak interview, Dutta said, \"I loved the part where Akshay...said, 'You need to dismantle yourself'.\""}, {"category": "entertainment", "title": "Diagnosed with Influenza B, staying away from my babies: Debina", "content": "Actress Debina Bonnerjee took to Instagram Stories and revealed that she has been diagnosed with Influenza B. The actress shared a picture of test results and wrote, \"So got Influenza B Virus. Well, hang on Mamma! Staying away from my babies now...Motherhood is anything but easy.\" Debina also shared that she had a fever and cough."}, {"category": "entertainment", "title": "There's a plan to make a spy film with the women: 'Pathaan' writer", "content": "'Pathaan' writer Shridhar Raghavan has said that there is a plan to make a women-led spy film in Yash Raj Films' spy universe. \"There's no limitation here and we don't just plan on working with Hrithik Roshan, Shah Rukh Khan and Salman Khan. There are two other crucial characters in the universe - Rubai and Zoya,\" he added."}, {"category": "entertainment", "title": "Shoojit Sircar shot ad with me, said 'You've acting bug': Kriti", "content": "Speaking about the time when she was pursuing B Tech, actress Kriti Sanon revealed that someone told her she should get into modelling as she has the height and face for it. \"I remember Shoojit Sircar...shot an ad with me! He told me, 'You've got that acting bug in you'...That's when I started dreaming about being an actor,\" she recalled."}, {"category": "entertainment", "title": "I want my character in 'Zwigato' to be appreciated: Kapil Sharma", "content": "Actor-comedian Kapil Sharma, speaking about his character in 'Zwigato' at the film's trailer launch, has said, \"I feel even if I don't get any appreciation that's ok, but I want my character to be appreciated.\" He added that the film will bring out all the emotions in the audience. 'Zwigato' is directed by Nandita Das."}, {"category": "entertainment", "title": "Grateful to Mohit for letting me record 'Galliyan': Shraddha", "content": "Actress Shraddha Kapoor said that she is \"grateful\" to filmmaker Mohit Suri for letting her record the unplugged version of the song 'Galliyan' from her film 'Ek Villain'. \"One day during the filming of 'Ek Villian'...Mohit [called me and said], 'Come to the studio, let's record the song 'Galliyan'',\" she added. Shraddha said she was terrified as she wasn't prepared."}, {"category": "entertainment", "title": "Kartik Aaryan announces 'Bhool Bhulaiyaa 3', to release in 2024", "content": "Actor Kartik Aaryan took to Instagram and announced the third instalment of the 'Bhool Bhulaiyaa' franchise. \"Rooh Baba Returns, Diwali 2024,\" the actor captioned his post. This comes after Kartik's 'Bhool Bhulaiyaa 2', which was directed by Anees Bazmee, collected over ₹260 crore worldwide. The first instalment, which was directed by Priyadarshan, featured Akshay Kumar and Vidya Balan."}]